{
    "home": "Inicio",
    "courses": "Cursos", 
    "contact": "Contacto",
    "about": "Acerca de",
    "language_label": "🌐 Idioma",
    "theme_label": "🎨 Tema",
    "font_size_label": "🔎 Tamaño de Fuente",
    "light_theme": "Claro",
    "dark_theme": "Oscuro",
    "small_font": "Pequeño",
    "medium_font": "Mediano",
    "large_font": "Grande",

    "check_channel": "👉 ¡Visita nuestro canal!",

    "welcome_title": "Bienvenido al Instituto de Español SpeakNow",
    "welcome_intro": "¡Aprende español con profesores nativos! Ya seas principiante total o busques perfeccionar tu fluidez, ofrecemos clases personalizadas que se ajustan a tus metas y horarios.",
    "feature_structured_courses": "📚 <b>Cursos estructurados</b> desde niveles A1 hasta C2",
    "feature_flexible_classes": "💻 <b>Clases en línea flexibles</b> — 1:1 o grupos pequeños o grupos grandes",
    "feature_tailored_lessons": "🌎 <b>Lecciones personalizadas</b> para viajes, negocios o práctica de conversación",
    "feature_friendly_teachers": "👩‍🏫 <b>Profesores amigables y experimentados</b> que te guían paso a paso",
    "feature_practical_learning": "🎯 <b>Aprendizaje práctico</b> centrado en la comunicación real",
    "feature_exam_preparation": "<b>Preparación para exámenes</b> con pruebas de práctica y retroalimentación para DELE y SIELE",
    "coming_soon": "¡Contáctanos hoy y comienza a hablar español con confianza!",
    "book_now": "Reserva Ahora",
    "why_choose_speaknow": "¿Por qué elegir SpeakNow?",
    "expert_teachers": "Profesores Nativos Expertos",
    "expert_teachers_desc": "Aprende con hablantes nativos calificados con años de experiencia docente y un profundo conocimiento cultural.",
    "personalized_approach": "Enfoque Personalizado",
    "personalized_approach_desc": "Lecciones adaptadas a tus objetivos, intereses y estilo de aprendizaje para mayor efectividad.",
    "flexible_scheduling": "Horarios Flexibles",
    "flexible_scheduling_desc": "Reserva clases que se adapten a tu estilo de vida con nuestra plataforma en línea y opciones de horarios flexibles.",
    "cultural_immersion": "Inmersión Cultural",
    "cultural_immersion_desc": "Más allá de la gramática, comprende las ricas culturas, tradiciones y perspectivas de los países hispanohablantes.",
    "practical_communication": "Comunicación Práctica",
    "practical_communication_desc": "Enfócate en escenarios reales y conversaciones que realmente usarás en la vida diaria, viajes o trabajo.",
    "ongoing_support": "Apoyo Continuo",
    "ongoing_support_desc": "Orientación, retroalimentación y motivación constantes para ayudarte a alcanzar tus objetivos de aprendizaje de español.",
    "by_the_numbers": "En Números",
    "students_taught": "Estudiantes Enseñados",
    "lessons_completed": "Lecciones Completadas",
    "countries_represented": "Países Representados",
    "satisfaction_rate": "Índice de Satisfacción",
    "ready_to_begin": "¿Listo para comenzar tu viaje en español?",
    "join_our_community": "Únete a nuestra comunidad de estudiantes y descubre la alegría de conectar con nuevas culturas a través del idioma.",
    "start_free_trial": "Comenzar",
    "get_in_touch": "Contáctanos",
    "courses_title": "Cursos de Español",
    "courses_intro": "Elige de nuestra amplia gama de cursos de español diseñados para llevarte desde principiante completo hasta hablante fluido. Todos los cursos son impartidos por instructores nativos cualificados con atención personalizada.",
    "beginner_title": "Principiante (A1-A2)",
    "beginner_level": "Principiante",
    "beginner_desc": "Perfecto para quienes comienzan su viaje en español. Aprende vocabulario esencial, gramática básica y conversaciones cotidianas.",
    "beginner_feature_1": "✓ Saludos básicos y presentaciones",
    "beginner_feature_2": "✓ Verbos en tiempo presente",
    "beginner_feature_3": "✓ Números, colores y familia",
    "beginner_feature_4": "✓ Frases para compras y comidas",
    "beginner_feature_5": "✓ Tiempo pasado simple",
    "intermediate_title": "Intermedio (B1-B2)",
    "intermediate_level": "Intermedio",
    "intermediate_desc": "Construye sobre tu base con gramática más compleja, vocabulario expandido y habilidades de conversación con confianza.",
    "intermediate_feature_1": "✓ Modo subjuntivo",
    "intermediate_feature_2": "✓ Estructuras de oraciones complejas",
    "intermediate_feature_3": "✓ Discusiones culturales",
    "intermediate_feature_4": "✓ Vocabulario profesional",
    "intermediate_feature_5": "✓ Expresión de opiniones",
    "advanced_title": "Avanzado (C1-C2)",
    "advanced_level": "Avanzado",
    "advanced_desc": "Alcanza la fluidez con gramática avanzada, textos literarios y conversación sofisticada sobre cualquier tema.",
    "advanced_feature_1": "✓ Dominio gramatical avanzado",
    "advanced_feature_2": "✓ Literatura y poesía",
    "advanced_feature_3": "✓ Debate y argumentación",
    "advanced_feature_4": "✓ Escritura académica",
    "advanced_feature_5": "✓ Variaciones regionales",
    "duration_12_16_weeks": "📅 12-16 semanas",
    "duration_16_20_weeks": "📅 16-20 semanas",
    "duration_20_24_weeks": "📅 20-24 semanas",
    "duration_8_12_weeks": "8-12 semanas",
    "duration_6_8_weeks": "6-8 semanas",
    "duration_10_16_weeks": "10-16 semanas",
    "duration_ongoing": "Continuo",
    "format_individual_groups": "👥 1:1 o Grupos Pequeños",
    "learn_more": "Saber Más",
    "specialized_title": "Cursos Especializados",
    "business_spanish": "Español de Negocios",
    "business_desc": "Domina el español profesional para reuniones, presentaciones, negociaciones y comunicación laboral.",
    "travel_spanish": "Español para Viajes",
    "travel_desc": "Frases y vocabulario esencial para viajeros. Navega aeropuertos, hoteles, restaurantes y atracciones turísticas.",
    "conversation_practice": "Práctica de Conversación",
    "conversation_desc": "Mejora tu fluidez oral a través de conversaciones guiadas sobre temas diversos con hablantes nativos.",
    "dele_prep": "Preparación DELE",
    "dele_desc": "Preparación integral para los exámenes oficiales de competencia en español DELE (niveles A1-C2).",
    "siele_prep": "Preparación SIELE",
    "siele_desc": "Preparación específica para el examen internacional de certificación español SIELE con pruebas de práctica y estrategias.",
    "kids_spanish": "Español para Niños",
    "kids_desc": "Lecciones de español divertidas e interactivas diseñadas específicamente para niños de 6-15 años, con juegos, canciones y actividades.",
    "why_choose_title": "¿Por qué elegir nuestros cursos?",
    "native_teachers": "Profesores Nativos",
    "native_teachers_desc": "Aprende con hablantes nativos experimentados con credenciales académicas probadas.",
    "flexible_schedule": "Horario Flexible",
    "flexible_schedule_desc": "Elige tus horarios de clase y estudia a tu propio ritmo con nuestra plataforma en línea.",
    "personalized_learning": "Aprendizaje Personalizado",
    "personalized_learning_desc": "Lecciones personalizadas basadas en tu estilo de aprendizaje, objetivos e intereses.",
    "comprehensive_materials": "Materiales Completos",
    "comprehensive_materials_desc": "Acceso a libros de texto digitales, recursos de audio y ejercicios interactivos.",
    "qualified_teachers": "Profesores Cualificados",
    "qualified_teachers_desc": "Aprende con instructores nativos experimentados con credenciales académicas y metodología de enseñanza probada.",
    "dual_language_learning": "Aprendizaje Bilingüe",
    "dual_language_learning_desc": "Desarrolla fluidez en español mientras perfeccionas tu inglés a través de nuestro enfoque de aprendizaje dual.",
    "chinese_instruction": "Instrucción en Chino",
    "chinese_instruction_desc": "¿Hablas chino? Ofrecemos clases de español impartidas en chino mandarín para hablantes nativos de chino.",
    "ready_to_start": "¿Listo para comenzar tu viaje en español?",
    "free_consultation": "Contáctanos para encontrar el curso perfecto para tus necesidades y objetivos.",
    "book_consultation": "Contáctanos",
    "contact_us": "Contáctanos",
    "contact_title": "Contáctanos",
    "contact_intro": "¿Listo para comenzar tu viaje de aprendizaje del español? ¡Nos encantaría saber de ti! Ponte en contacto con nuestro equipo para conocer más sobre nuestros cursos o hacer cualquier pregunta.",
    "send_message": "Envíanos un Mensaje",
    "full_name": "Nombre",
    "email": "Correo Electrónico",
    "phone": "Número de Teléfono",
    "current_level": "Nivel Actual de Español",
    "select_level": "Selecciona tu nivel",
    "absolute_beginner": "Principiante Absoluto",
    "not_sure": "No Estoy Seguro",
    "interested_in": "¿En qué estás interesado?",
    "select_interest": "Selecciona una opción",
    "general_spanish": "Cursos Generales de Español",
    "business_spanish_option": "Español de Negocios",
    "travel_spanish_option": "Español para Viajes",
    "conversation_practice_option": "Práctica de Conversación",
    "dele_preparation": "Preparación para el Examen DELE",
    "siele_preparation": "Preparación para el Examen SIELE",
    "other": "Otro",
    "message": "Mensaje",
    "message_placeholder": "Cuéntanos sobre tus objetivos, horario preferido o cualquier pregunta que tengas...",
    "newsletter_signup": "Me gustaría recibir actualizaciones sobre nuevos cursos y consejos para aprender español",
    "send_message_btn": "Enviar Mensaje",
    "email_us": "Envíanos un Correo",
    "email_response": "Responderemos dentro de 24 horas",
    "whatsapp": "WhatsApp",
    "whatsapp_hours": "Lun-Vie: 9AM-6PM EST",
    "office_hours": "Horario de Oficina",
    "hours_schedule": "Lunes - Viernes: 9:00 AM - 8:00 PM EST",
    "weekend_hours": "Sábado: 10:00 AM - 4:00 PM EST",
    "timezone_note": "Todos los horarios en Hora Estándar del Este",
    "quick_actions": "Acciones Rápidas",
    "book_trial": "Contáctanos",
    "schedule_consultation": "Programar Consulta",
    "view_courses": "Ver Nuestros Cursos",
    "common_questions": "Preguntas Comunes",
    "faq_trial_question": "¿Cómo puedo comenzar con las clases?",
    "faq_trial_answer": "Simplemente contáctanos y te ayudaremos a elegir el curso perfecto para tu nivel y objetivos.",
    "faq_schedule_question": "¿Qué tan flexibles son los horarios de clase?",
    "faq_schedule_answer": "¡Muy flexibles! Puedes reservar clases que se adapten a tu horario, con opciones desde temprano en la mañana hasta la noche.",
    "faq_class_types_question": "¿Qué tipos de clases ofrecen?",
    "faq_class_types_answer": "Ofrecemos opciones flexibles para cada estilo de aprendizaje y presupuesto:<br><br><strong>• Clases Grupales (8-20 Estudiantes):</strong> Nuestra opción más económica para una experiencia de aprendizaje interactiva y social.<br><br><strong>• Clases de Grupos Pequeños (1-en-2 o 1-en-3):</strong> Un equilibrio perfecto entre atención personal y motivación entre compañeros. Ideal para aprender con amigos.<br><br><strong>• Cursos Personalizados 1-a-1:</strong> Completamente adaptados a tus objetivos personales y horario para el progreso más rápido y eficiente.",
    "message_sent": "¡Mensaje Enviado Exitosamente!",
    "message_sent_text": "Gracias por contactarnos. Te responderemos dentro de 24 horas.",
    "close": "Cerrar",
    "about_title": "Acerca del Instituto de Español SpeakNow",
    "about_intro": "Nos apasiona conectar culturas a través del aprendizaje de idiomas. Desde nuestra fundación, hemos ayudado a miles de estudiantes a descubrir la alegría de hablar español mientras construimos puentes entre países hispanohablantes y el mundo.",
    "our_story_title": "Nuestra Historia",
    "our_story_p1": "El Instituto de Español SpeakNow nació de una creencia simple: aprender español debe ser atractivo, práctico y estar profundamente conectado con las ricas culturas hispanohablantes. Fundado por un equipo de educadores apasionados y hablantes nativos, vimos la necesidad de instrucción de español personalizada y de alta calidad que vaya más allá de los libros de texto.",
    "our_story_p2": "Lo que comenzó como un pequeño grupo de profesores compartiendo su amor por el idioma español se ha convertido en un instituto en línea integral. Hemos mantenido nuestros valores fundamentales: inmersión cultural auténtica, atención personalizada y habilidades de comunicación práctica que puedes usar desde el primer día.",
    "our_story_p3": "Hoy, estamos orgullosos de ofrecer cursos para todos los niveles, desde principiantes completos hasta hablantes avanzados que buscan perfeccionar su fluidez. Nuestros estudiantes provienen de muchos orígenes diferentes, unidos por su deseo de conectar con las culturas de habla hispana alrededor del mundo.",
    "our_mission": "Nuestra Misión",
    "mission_text": "Hacer que el aprendizaje del español sea accesible, agradable y culturalmente enriquecedor para estudiantes de todo el mundo. Creemos que todos merecen la oportunidad de comunicarse con confianza en español y conectar con las vibrantes culturas hispanohablantes.",
    "our_vision": "Nuestra Visión",
    "vision_text": "Ser la plataforma líder para la educación auténtica en español, fomentando el entendimiento global y la apreciación cultural. Visualizamos un mundo donde las barreras del idioma no limiten las oportunidades personales y profesionales.",
    "our_values_title": "Nuestros Valores",
    "authenticity_title": "Autenticidad",
    "authenticity_desc": "Todos nuestros profesores son hablantes nativos que aportan conocimientos culturales genuinos y experiencia del mundo real a cada lección.",
    "personalization_title": "Personalización",
    "personalization_desc": "Cada estudiante es único. Adaptamos nuestros métodos de enseñanza para coincidir con tu estilo de aprendizaje, objetivos e intereses.",
    "growth_title": "Crecimiento Continuo",
    "growth_desc": "Creemos en el aprendizaje de por vida - para nuestros estudiantes y para nosotros mismos. Mejoramos continuamente nuestros métodos y adoptamos nuevas tecnologías.",
    "cultural_bridge_title": "Puente Cultural",
    "cultural_bridge_desc": "El idioma es una puerta a la cultura. Ayudamos a los estudiantes a entender y apreciar la diversidad de los países de habla hispana.",
    "practical_focus_title": "Enfoque Práctico",
    "practical_focus_desc": "Priorizamos las habilidades de comunicación que puedes usar inmediatamente - ya sea para viajes, trabajo o conexiones personales.",
    "support_title": "Apoyo Inquebrantable",
    "support_desc": "Tu éxito es nuestro éxito. Proporcionamos aliento y apoyo continuo durante todo tu viaje de aprendizaje.",
    "meet_our_team": "Conoce a Nuestro Equipo",
    "team_intro": "Nuestro diverso equipo de hablantes nativos de español reúne décadas de experiencia docente de varios países hispanohablantes. Cada instructor es apasionado sobre compartir su idioma y cultura con estudiantes de todo el mundo.",
    "founder_title": "Fundadora e Instructora Principal",
    "maria_bio": "Con más de 15 años de experiencia docente, María fundó SpeakNow para compartir su pasión por la cultura mexicana y el idioma español. Se especializa en español conversacional y comunicación empresarial.",
    "senior_instructor": "Instructor Senior",
    "carlos_bio": "Carlos aporta la rica herencia cultural de Argentina a sus lecciones. Graduado en literatura con 12 años de experiencia docente, sobresale ayudando a estudiantes avanzados a perfeccionar su fluidez y comprensión cultural.",
    "spanish_instructor": "Instructor de Español",
    "ana_bio": "Ana se especializa en español principiante e intermedio, con enfoque en habilidades de comunicación práctica. Su estilo de enseñanza paciente y alentador ha ayudado a cientos de estudiantes a desarrollar confianza al hablar español.",
    "diego_bio": "Diego combina su formación en lingüística con su amor por la cultura peruana para crear lecciones atractivas e interactivas. Se especializa en instrucción gramatical y preparación para el examen DELE.",

    "learn_spanish": "Donde las Palabras se Convierten en Mundos",
    "contact_info": "Información de Contacto",
    "footer_address": "Dirección",
    "footer_phone": "Teléfono",
    "footer_email": "Correo",
    "follow_us": "Síguenos y Sigue Aprendiendo",
    "copyright": "Derechos de Autor",
    "registration_number": "Número de registro",
    "by": "por",
    "version": "Versión"
}